fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоров</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	  Если ИмяСобытия = "ДлительнаяОперацияЗавершена" Тогда
        
        Результат = Параметр.Результат;
        Если Результат.КодСостояния = "Выполнено" Тогда
            
            
            СтруктураРезультата = Результат.ДополнительныеСвойства.Результат;
            
            
            ОбновитьТабличнуюЧасть(СтруктураРезультата.СозданныеДокументы);
            
            Сообщить("Создано актов: " + СтруктураРезультата.КоличествоСозданных);
        Иначе
            Сообщить("Ошибка при выполнении: " + Результат.ТекстОшибки);
        КонецЕсли;
        
    КонецЕсли;
КонецПроцедуры

Процедура СоздатьАктыВФоне(ПараметрыВыполненияФункции, АдресРезультата) Экспорт
    
    // Получаем данные из временного хранилища
    Параметры = ПолучитьИзВременногоХранилища(ПараметрыВыполненияФункции.АдресХранилища);
    
    Период = Параметры.Период;
    МассивДоговоров = Параметры.Договоры;
    
    ДатаДокумента = КонецМесяца(Период); // или другая логика
    
    СозданныеДокументы = Новый Массив;
    
    Для Каждого Договор Из МассивДоговоров Цикл
        
        // Проверяем, не создал ли кто-то документ параллельно
        Существующий = НайтиСуществующуюРеализацию(Договор, Период);
        Если Существующий <> Неопределено Тогда
            Продолжить; // пропускаем
        КонецЕсли;
        
        // Создаём документ
        Док = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
        Док.Дата = ДатаДокумента;
        Док.Договор = Договор;
        // ... заполнить прочие реквизиты (организация, склад и т.д.), если необходимо
        
        // Вызов стандартного автозаполнения
        Док.ВыполнитьАвтозаполнение();
        
        // Проверка заполнения
        Попытка
            Док.ПроверитьЗаполнение();
        Исключение
            // Логируем ошибку и пропускаем документ
            ЗаписьЖурналаРегистрации("МассовоеСозданиеАктов", УровеньЖурналаРегистрации.Ошибка,,,
                "Ошибка проверки заполнения по договору " + Договор + ": " + ОписаниеОшибки());
            Продолжить;
        КонецПопытки;
        
        // Запись и проведение
        Док.Записать(РежимЗаписиДокумента.Проведение);
        
        СозданныеДокументы.Добавить(Док.Ссылка);
        
    КонецЦикла;
    
    // Формируем результат
    Результат = Новый Структура;
    Результат.Вставить("КоличествоСозданных", СозданныеДокументы.Количество());
    Результат.Вставить("СозданныеДокументы", СозданныеДокументы);
    
    // Сохраняем результат в указанный адрес
    СохранитьРезультатВАдрес(Результат, АдресРезультата);
    
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАкты(Команда)
	
    
    Если Не ЗначениеЗаполнено(Объект.Период) Тогда
        Сообщить("Укажите месяц формирования актов.");
        Возврат;
    КонецЕсли;
    
    
    ПараметрыВыполнения = Новый Структура;
    ПараметрыВыполнения.Вставить("Период", Объект.Период);
    
    
    МассивДоговоров = Новый Массив;
    Для Каждого Строка Из Объект.СписокДоговоров Цикл
        Если Не ЗначениеЗаполнено(Строка.Реализация) Тогда
            МассивДоговоров.Добавить(Строка.Договор);
        КонецЕсли;
    КонецЦикла;
    
    Если МассивДоговоров.Количество() = 0 Тогда
        Сообщить("Все акты за указанный период уже созданы.");
        Возврат;
    КонецЕсли;
    
    ПараметрыВыполнения.Вставить("Договоры", МассивДоговоров);
    
    
    АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыВыполнения, УникальныйИдентификатор);
    
   
    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
    
    ПараметрыВыполненияФункции = Новый Структура;
    ПараметрыВыполненияФункции.Вставить("АдресХранилища", АдресХранилища);
    
    
    ДлительныеОперацииКлиент.ВыполнитьФункцию(
        "Обработка.МассовоеСозданиеАктов.СоздатьАктыВФоне",
        ПараметрыВыполненияФункции,
        ПараметрыОжидания,
        "Создание актов по абонентским договорам");
    
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоДоговорам(Команда)
	ЗаполнитьПоДоговорамСервер();
КонецПроцедуры	
   


&НаСервере
Процедура ЗаполнитьПоДоговорамСервер()
	   Если Не ЗначениеЗаполнено(Объект.Период) Тогда
	   	Сообщение = Новый СообщениеПользователю();
	   	Сообщение.Текст = "Укажите месяц формирования актов.";
	   	Сообщение.Сообщить();
        
        Возврат;
    КонецЕсли;
    
   
    Объект.СписокДоговоров.Очистить();
    
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   Договоры.Ссылка КАК Договор
    |ИЗ
    |   Справочник.ДоговорыКонтрагентов КАК Договоры
    |ГДЕ
    |   Договоры.ВидДоговора = &ВидДоговора
    |   И НЕ Договоры.ПометкаУдаления";
    
    
    Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        НоваяСтрока = Объект.СписокДоговоров.Добавить();
        НоваяСтрока.Договор = Выборка.Договор;
        НоваяСтрока.Реализация = НайтиСуществующуюРеализацию(Выборка.Договор, Объект.Период);
    КонецЦикла;
КонецПроцедуры

&НаСервере
Функция НайтиСуществующуюРеализацию(Договор, Период) Экспорт
    
    НачалоМесяца = НачалоМесяца(Период);
    КонецМесяца = КонецМесяца(Период);
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |   Реализация.Ссылка
    |ИЗ
    |   Документ.РеализацияТоваровУслуг КАК Реализация
    |ГДЕ
    |   Реализация.Договор = &Договор
    |   И Реализация.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
    |   И Реализация.Проведен";
    
    Запрос.УстановитьПараметр("Договор", Договор);
    Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца);
    Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Ссылка;
    Иначе
        Возврат Неопределено;
    КонецЕсли;
    
КонецФункции
